# 現在のルーティング情報の表示
```
# route
```

---
# 一時的なルーティング情報の付加
```
# ip route add 192.168.0.0/24 via 192.168.100.2 dev enp1s0

・dev は省略可能
```

---
# ルーティング情報を恒久化する場合

```
・インターフェイス名を確認
# nmcli c s

・インターフェイスの編集モードを起動
# nmcli c e enp1s0

・インターフェイスの編集モードに入る

・現状の設定を確認
nmcli> print ipv4.routes

・ルーティング情報の追加
nmcli> set ipv4.routes 192.168.0.0/24 192.168.100.2

・追加設定の確認
nmcli> print ipv4.routes

・追加設定の保存
nmcli> save persistent

・nmcliモードから離脱
nmcli> quit
```

* 設定が正しく反映された場合、`/etc/sysconfig/network-scripts/` に `route-enp1s0` というファイルができているはず。  
* route-enp1s0 のサンプル
```
ADDRESS0=192.168.0.0
NETMASK0=255.255.255.0
GATEWAY0=192.168.100.2
```
